create_clock -period 10.000 -name clk -waveform {0.000 5.000} [get_ports clk]
create_generated_clock -name uut1/clkout_OBUF -source [get_ports clk] -divide_by 100000000 [get_pins uut1/c_out_reg/Q]
create_clock -period 1000000000.000 -name VIRTUAL_uut1/clkout_OBUF -waveform {0.000 500000000.000}
set_input_delay -clock [get_clocks VIRTUAL_uut1/clkout_OBUF] -min -add_delay 2.000 [get_ports {code_in[*]}]
set_input_delay -clock [get_clocks VIRTUAL_uut1/clkout_OBUF] -max -add_delay 2.000 [get_ports {code_in[*]}]
set_input_delay -clock [get_clocks VIRTUAL_uut1/clkout_OBUF] -min -add_delay 2.000 [get_ports admin_reset]
set_input_delay -clock [get_clocks VIRTUAL_uut1/clkout_OBUF] -max -add_delay 2.000 [get_ports admin_reset]
set_input_delay -clock [get_clocks VIRTUAL_uut1/clkout_OBUF] -min -add_delay 2.000 [get_ports enter]
set_input_delay -clock [get_clocks VIRTUAL_uut1/clkout_OBUF] -max -add_delay 2.000 [get_ports enter]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports reset]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports reset]
set_input_delay -clock [get_clocks VIRTUAL_uut1/clkout_OBUF] -min -add_delay 2.000 [get_ports reset]
set_input_delay -clock [get_clocks VIRTUAL_uut1/clkout_OBUF] -max -add_delay 2.000 [get_ports reset]
set_output_delay -clock [get_clocks VIRTUAL_uut1/clkout_OBUF] -min -add_delay 0.000 [get_ports {attempt_led[*]}]
set_output_delay -clock [get_clocks VIRTUAL_uut1/clkout_OBUF] -max -add_delay 2.000 [get_ports {attempt_led[*]}]
set_output_delay -clock [get_clocks VIRTUAL_uut1/clkout_OBUF] -min -add_delay 0.000 [get_ports lockout_led]
set_output_delay -clock [get_clocks VIRTUAL_uut1/clkout_OBUF] -max -add_delay 2.000 [get_ports lockout_led]
set_output_delay -clock [get_clocks VIRTUAL_uut1/clkout_OBUF] -min -add_delay 0.000 [get_ports unlock_led]
set_output_delay -clock [get_clocks VIRTUAL_uut1/clkout_OBUF] -max -add_delay 2.000 [get_ports unlock_led]
set_property IOSTANDARD LVCMOS18 [get_ports admin_reset]
set_property IOSTANDARD LVCMOS18 [get_ports clk]
set_property IOSTANDARD LVCMOS18 [get_ports clkout]
set_property IOSTANDARD LVCMOS18 [get_ports enter]
set_property IOSTANDARD LVCMOS18 [get_ports lockout_led]
set_property IOSTANDARD LVCMOS18 [get_ports {attempt_led[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {attempt_led[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {attempt_led[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {code_in[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {code_in[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {code_in[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {code_in[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports reset]
set_property IOSTANDARD LVCMOS18 [get_ports unlock_led]
set_property PACKAGE_PIN Y9 [get_ports clk]
set_property PACKAGE_PIN V22 [get_ports {attempt_led[2]}]
set_property PACKAGE_PIN W22 [get_ports {attempt_led[1]}]
set_property PACKAGE_PIN U19 [get_ports {attempt_led[0]}]
set_property PACKAGE_PIN M15 [get_ports {code_in[3]}]
set_property PACKAGE_PIN H17 [get_ports {code_in[2]}]
set_property PACKAGE_PIN H18 [get_ports {code_in[1]}]
set_property PACKAGE_PIN H19 [get_ports {code_in[0]}]
set_property PACKAGE_PIN U14 [get_ports clkout]
set_property PACKAGE_PIN F21 [get_ports admin_reset]
set_property PACKAGE_PIN N15 [get_ports enter]
set_property PACKAGE_PIN P16 [get_ports reset]
set_property PACKAGE_PIN T22 [get_ports lockout_led]
set_property PACKAGE_PIN T21 [get_ports unlock_led]
